0.1.0/tutorials/heat-transfer/buoyant-simple/hot_radiation_room/constant/radiationProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      radiationProperties;
}

radiation on;
radiationModel  P1;
// Number of flow iterations per radiation iteration
solverFreq 1;
absorptionEmissionModel constantAbsorptionEmission;
constantAbsorptionEmissionCoeffs
{
  absorptivity    absorptivity    [0 -1 0 0 0 0 0] 0.5;
  emissivity      emissivity      [0 -1 0 0 0 0 0] 0.5;
  E               E               [1 -1 -3 0 0 0 0] 0;
}
scatterModel    none;
sootModel       none;

// vim: set ft=foam et sw=2 ts=2 sts=2:
