0.1.0/tutorials/heat-transfer/buoyant-simple/hot_radiation_room/0/alphat
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  box
  {
    type            compressible::alphatWallFunction;
    value           uniform 0;
  }
  floor
  {
    type            compressible::alphatWallFunction;
    value           uniform 0;
  }
  ceiling
  {
    type            compressible::alphatWallFunction;
    value           uniform 0;
  }
  fixedWalls
  {
    type            compressible::alphatWallFunction;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
