0.1.0/tutorials/heat-transfer/buoyant-simple/hot_radiation_room/0/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.1;

boundaryField
{
  box
  {
    type            kqRWallFunction;
    value           uniform 0.1;
  }
  floor
  {
    type            kqRWallFunction;
    value           uniform 0.1;
  }
  ceiling
  {
    type            kqRWallFunction;
    value           uniform 0.1;
  }
  fixedWalls
  {
    type            kqRWallFunction;
    value           uniform 0.1;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
