0.1.0/tutorials/heat-transfer/buoyant-simple/hot_radiation_room/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p_rgh
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0.01;
  }
  "(U|h|k|epsilon)"
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0.1;
  }
  G
  {
    $p_rgh;
    tolerance       1e-05;
    relTol          0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
  residualControl
  {
    p_rgh           1e-2;
    U               1e-3;
    h               1e-3;
    G               1e-3;
    // possibly check turbulence fields
    "(k|epsilon|omega)" 1e-3;
  }
}
relaxationFactors
{
  fields
  {
    rho             1.0;
    p_rgh           0.7;
  }
  equations
  {
    U               0.2;
    h               0.2;
    "(k|epsilon|R)" 0.5;
    G               0.7;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
